public class ArrayManipulation {

    /*
    n = 10,
    n은 '0'으로 이루어진 배열 길이 (ex: [0,0,0,0,0,0,0,0,0,0])
    숫자 범위는 input으로 주어짐 (ex : 아래 예제는 1 ~ 9)
    오퍼레이션은 행의 수 (ex : 아래 예제는 3행)
    오퍼레이션 : k의 값을 a, b 배열 인덱스에 더해준다, 이 과정을 오퍼레이션 수만큼 실행
    return값은 배열 요소 중 최대 값

    //주어진 값
    a b k
    1 5 3 // 1과 5 인덱스에 3을 더함
    4 8 7 // 4와 8인덱스에 7을 더함
    6 9 1

    // 결과
    index->	 1 2 3  4  5 6 7 8 9 10
            [0,0,0, 0, 0,0,0,0,0, 0] // 0부터 시작
            [3,3,3, 3, 3,0,0,0,0, 0]
            [3,3,3,10,10,7,7,7,0, 0]
            [3,3,3,10,10,8,8,8,1, 0]

    // 최대 값은 10
    */
    public static void main(String[] args) {

    }
}
